<a href="https://colab.research.google.com/github/D-Sritha-D/EDA_Projects_Pandas/blob/main/English_Words_EDA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import the Pandas library

In [2]:
import pandas as pd

Read the txt file into a dataframe

In [3]:
df = pd.read_csv("unix-words.txt")

Display the first 10 rows of the dataframe

In [4]:
df.head(10)

          A
0         a
1        aa
2       aal
3     aalii
4       aam
5      Aani
6  aardvark
7  aardwolf
8     Aaron
9   Aaronic

Change the column name 'A' to the words

In [5]:
df.rename(columns={'A':'words'},inplace=True)

Add character count of each word as another column in the dataframe

In [6]:
df['words']= df["words"].fillna('')
df['cc'] = df["words"].apply(len)
df

             words  cc
0                a   1
1               aa   2
2              aal   3
3            aalii   5
4              aam   3
...            ...  ..
235880      zythem   6
235881      Zythia   6
235882      zythum   6
235883     Zyzomys   7
235884  Zyzzogeton  10

[235885 rows x 2 columns]

Add a column called value which is the sum of the numerical positions of the alphabets in the word
(Ex: aah = 1 + 1 + 8 = 10)

In [21]:
def cus_fun(x):
    summ = 0
    x.lower()
    z = list(x)
    for i in range(len(z)):
        n= z.pop()
        a_value =ord(n)-96
        summ = summ +a_value
    return summ

In [22]:
df['total_num']= df['words'].apply(cus_fun)

Write a command to find the number of items in the dataframe

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 235885 entries, 0 to 235884
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   words   235885 non-null  object
 1   cc      235885 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.6+ MB

Set the words as the index of the dataframe

In [23]:

df

             words  cc  total_num
0                a   1          1
1               aa   2          2
2              aal   3         14
3            aalii   5         32
4              aam   3         15
...            ...  ..        ...
235880      zythem   6         97
235881      Zythia   6         57
235882      zythum   6        113
235883     Zyzomys   7        117
235884  Zyzzogeton  10        147

[235885 rows x 3 columns]

What is the value of the word 'Acanthomeridae'?

In [24]:
df.loc[df["words"]=="Acanthomeridae"]

              words  cc  total_num
762  Acanthomeridae  14         85

What is the highest possible value for a word?

In [25]:
df['total_num'].max()

328

What is the highest possible length of a word

In [26]:
df['cc'].max()

24

What is the value of the word with Value '317'

In [27]:
df.loc[df['total_num']==317]

                           words  cc  total_num
203040  thyroparathyroidectomize  24        317

What is the most common value?

In [77]:
max(df["total_num"].value_counts())

2218

In [81]:
df["total_num"].value_counts()

total_num
102    2218
107    2194
100    2185
108    2184
115    2171
       ...
305       1
289       1
317       1
283       1
314       1
Name: count, Length: 336, dtype: int64

What is the shortest word with the value of 107

In [86]:
df.loc[df["total_num"] == 107].min()

words        Agriochoerus
cc                      5
total_num             107
Ratio            6.294118
dtype: object

In [83]:
df1 = df.loc[df['total_num'] == 107]
min(df1["words"],key = len)
#df1.loc[df1["words"] == df1["cc"].min()]

'yezzy'

Create a new column 'Ratio' such that ratio = value/char count

In [51]:
df["Ratio"] = df['total_num']/df["cc"]
df

             words  cc  total_num      Ratio
0                a   1          1   1.000000
1               aa   2          2   1.000000
2              aal   3         14   4.666667
3            aalii   5         32   6.400000
4              aam   3         15   5.000000
...            ...  ..        ...        ...
235880      zythem   6         97  16.166667
235881      Zythia   6         57   9.500000
235882      zythum   6        113  18.833333
235883     Zyzomys   7        117  16.714286
235884  Zyzzogeton  10        147  14.700000

[235885 rows x 4 columns]

What is the maximum value of ratio?

In [57]:
max1 = df["Ratio"].max()
max1

26.0

What is the word with the highest ratio

In [56]:
df.loc[df['Ratio'] == max1]

       words  cc  total_num  Ratio
234937     z   1         26   26.0

How many words have the ratio of 10

In [61]:
len(df.loc[df["Ratio"] == 10])

3159

What is the maximum value of all words with ratio as 10

In [64]:
df2 = df.loc[df['Ratio'] == 10]
max(df2["total_num"])

210

Of all the words with the value of 260, what has the loswest character count?

In [68]:
df3 = df.loc[df['total_num'] == 260]
min(df3["words"],key = len)

'gastrohysteropexy'

In [87]:
df.loc[df["total_num" == 260 ] and min(df["cc"])]

KeyError: False